#Напишете програма, която пресмята нужните разходи за закупуването на храна за кучета и други животни.
# Една опаковка храна за кучета е на цена 2.50лв., а всяка останала, която не е за тях струва 4лв.
#Вход
#От конзолата се четат 2 реда:
#   1. Броят на кучетата - цяло число;
#   2. Броят на останалите животни  - цяло число.
#Изход
#На конзолата се отпечатва:
#"{крайната сума} lv."
dog_num = int(input())
other_pet = int(input())
result = (dog_num * 2.50) + (other_pet * 4)
print(f'{result} lv.')